# 1_1 Поработайте с переменными, создайте несколько, выведите на экран.
my_str = 'Hello GeekBrains!'
my_int = 2020
my_float = 10.75
print('Это строка:', my_str)
print('Это целое число:', my_int)
print('Это число с плавающей точкой:', my_float)

# 1_2 Запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
first_name = input('Введите имя:\n')
last_name = input('Введите фамилию:\n')
age = input('Введите возраст:\n')
print('\nЗдравствуйте,', first_name, last_name)
print('Ваш возраст:', age)