'''6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же, но с прописной первой буквой.
Например, print(int_func(‘text’)) -> Text.
В программу должна попадать строка из слов, разделенных пробелом.
Каждое слово состоит из латинских букв в нижнем регистре.
Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы.
Необходимо использовать написанную ранее функцию int_func().'''

def int_func(str):
    return str.capitalize()

def int_func2(str):
    return ' '.join(map(int_func, str.split(' ')))

print(int_func('привет'))
print(int_func2('как твои дела?'))